TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_uart.h
    return (DL_UART_TXD_OUT)(txdOutVal);
}

/**
 *  @brief      Enable Manchester encoding
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableManchesterEncoding(UART_Regs *uart)
{
    uart->CTL0 |= UART_CTL0_MENC_ENABLE;
}

/**
 *  @brief      Disable Manchester encoding
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableManchesterEncoding(UART_Regs *uart)
{
    uart->CTL0 &= ~(UART_CTL0_MENC_MASK);
}

/**
 *  @brief      Check if Manchester encoding is enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of Manchester encode
 *
 *  @retval     true  Manchester encoding is enabled
 *  @retval     false Manchester encoding is disabled
 */
__STATIC_INLINE bool DL_UART_isManchesterEncodingEnabled(UART_Regs *uart)
{
    return ((uart->CTL0 & UART_CTL0_MENC_MASK) == UART_CTL0_MENC_ENABLE);
}

/**
 *  @brief      Set the communication mode/protocol to use
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *  @param[in]  mode  Value to set the UART communication protocol to.
 *                     One of @ref DL_UART_MODE
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_setCommunicationMode(
    UART_Regs *uart, DL_UART_MODE mode)
{
    DL_Common_updateReg(&uart->CTL0, (uint32_t) mode, UART_CTL0_MODE_MASK);
}

/**
 *  @brief      Get the communication mode/protocol being used
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The communication mode/protocol being used by the UART
 *
 *  @retval     One of @ref DL_UART_MODE
 */
__STATIC_INLINE DL_UART_MODE DL_UART_getCommunicationMode(UART_Regs *uart)
{
    uint32_t mode = uart->CTL0 & UART_CTL0_MODE_MASK;

    return (DL_UART_MODE)(mode);
}

/**
 *  @brief      Set the flow control configuration
 *
 *  @param[in]  uart    Pointer to the register overlay for the peripheral
 *  @param[in]  config  The flow control configuration to use.
 *                      One of @ref DL_UART_FLOW_CONTROL.
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_setFlowControl(
    UART_Regs *uart, DL_UART_FLOW_CONTROL config)
{
    DL_Common_updateReg(&uart->CTL0, (uint32_t) config,
        UART_CTL0_RTSEN_MASK | UART_CTL0_CTSEN_MASK);
}

/**
 *  @brief      Check the flow control configuration
 *
 *  @param[in]  uart  Pointer to the register overlay for the
 *                    peripheral
 *
 *  @return     The flow control configuration
 *
 *  @retval     One of @ref DL_UART_FLOW_CONTROL values
 */
__STATIC_INLINE DL_UART_FLOW_CONTROL DL_UART_getFlowControl(UART_Regs *uart)
{
    uint32_t config =
        uart->CTL0 & (UART_CTL0_RTSEN_MASK | UART_CTL0_CTSEN_MASK);

    return (DL_UART_FLOW_CONTROL)(config);
}

/**
 *  @brief      Set the request to send output signal
 *
 *  The RTS output signal indicates the state of the RX FIFO, and is
 *  linked to the programmable receive FIFO threshold levels. When RTS flow
 *  control is enabled, the RTS signal is asserted (low) when the data in the
 *  RX FIFO is less than the threshold level. When the RX FIFO threshold level
 *  is reached, the RTS signal is deasserted (high). The RTS signal is
 *  reasserted (low) when data has been read out  of the RX FIFO so it is less
 *  than the threshold.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *  @param[in]  val   The RTS output signal. One of @ref DL_UART_RTS
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 *
 *  @sa         DL_UART_setTXFIFOThreshold
 */
__STATIC_INLINE void DL_UART_setRTSOutput(UART_Regs *uart, DL_UART_RTS val)
{
    DL_Common_updateReg(&uart->CTL0, (uint32_t) val, UART_CTL0_RTS_MASK);
}

/**
 *  @brief      Get the request to send output signal
 *
 *  The RTS output signal indicates the state of the RX FIFO, and is
 *  linked to the programmable receive FIFO threshold levels. When RTS flow
 *  control is enabled, the RTS signal is asserted (low) when the data in the
 *  RX FIFO is less than the threshold level. When the RX FIFO threshold level
 *  is reached, the RTS signal is deasserted (high). The RTS signal is
 *  reasserted (low) when data has been read out  of the RX FIFO so it is less
 *  than the threshold.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The RTS signal status
 *
 *  @retval     One of @ref DL_UART_RTS
 *
 *  @sa         DL_UART_setTXFIFOThreshold
 */
__STATIC_INLINE DL_UART_RTS DL_UART_getRTSOutput(UART_Regs *uart)
{
    uint32_t val = uart->CTL0 & UART_CTL0_RTS_MASK;

    return (DL_UART_RTS)(val);
}

/**
 *  @brief      Enable FIFOs
 *
 *  Enables the transmit and receive FIFO buffers.
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 *
 *  @sa         DL_UART_init
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_enableFIFOs(UART_Regs *uart)
{
    uart->CTL0 |= UART_CTL0_FEN_ENABLE;
}

/**
 *  @brief      Disable FIFOs
 *
 *  Disables the transmit and receive FIFO buffers. The receiver will now
 *  only hold 1-byte of data.
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 *
 *  @pre  If the UART has already been enabled, then it must be made ready for
 *        configuration by first calling @ref DL_UART_changeConfig
 *  @post If @ref DL_UART_changeConfig was called, then the UART must be
 *        re-enabled by calling @ref DL_UART_enable
 */
__STATIC_INLINE void DL_UART_disableFIFOs(UART_Regs *uart)
{
    uart->CTL0 &= ~(UART_CTL0_FEN_MASK);
}

/**
 *  @brief      Check if FIFOs are enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of the FIFOs
 *
 *  @retval     true  FIFOs are enabled
 *  @retval     false FIFOs are disabled
 */
__STATIC_INLINE bool DL_UART_isFIFOsEnabled(UART_Regs *uart)
{
    return ((uart->CTL0 & UART_CTL0_FEN_MASK) == UART_CTL0_FEN_ENABLE);
}

/**
 *  @brief      Enable send break (for LIN protocol)
 *
 *  When enabled, a low level is continually output on the TXD signal after completing
 *  transmission of the current character. For the proper execution of the
 *  break command, software must set this bit for at least two frames (character periods).
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableLINSendBreak(UART_Regs *uart)
{
    uart->LCRH |= UART_LCRH_BRK_ENABLE;
}

/**
 *  @brief      Disable send break
 *
 *  When disabled, a low level is not continually output on the TXD signal
 *  after completing transmission of the current character.
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINSendBreak(UART_Regs *uart)
{
    uart->LCRH &= ~(UART_LCRH_BRK_MASK);
}

/**
 *  @brief      Check if send break is enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of send break
 *
 *  @retval     true  Send break is enabled
 *  @retval     false Send break is disabled
 */
__STATIC_INLINE bool DL_UART_isLINSendBreakEnabled(UART_Regs *uart)
{
    return ((uart->LCRH & UART_LCRH_BRK_MASK) == UART_LCRH_BRK_ENABLE);
}

/**
 *  @brief      Check if parity is enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of parity
 *
 *  @retval     true  Parity is enabled
 *  @retval     false Parity is disabled
 */
__STATIC_INLINE bool DL_UART_isParityEnabled(UART_Regs *uart)
{
    return ((uart->LCRH & UART_LCRH_PEN_MASK) == UART_LCRH_PEN_ENABLE);
}

/**
 *  @brief      Set the parity mode
 *
 *  For 9-bit UART mode transmissions, the parity mode affects the address
 *  byte and data byte indication (9th bit). If DL_UART_PARITY_EVEN or
 *  DL_UART_PARITY_STICK_ZERO is enabled, then the transferred byte is a data
 *  byte.  If DL_UART_PARITY_EVEN or DL_UART_PARITY_STICK_ZERO is not enabled,
 *  then the transferred byte is an address byte.
 *
 *  @param[in]  uart    Pointer to the register overlay for the peripheral
 *  @param[in]  parity  Parity mode to set UART to.
 *                      One of @ref DL_UART_PARITY
 */
__STATIC_INLINE void DL_UART_setParityMode(
    UART_Regs *uart, DL_UART_PARITY parity)
{
    DL_Common_updateReg(&uart->LCRH, (uint32_t) parity,
        (UART_LCRH_PEN_MASK | UART_LCRH_EPS_MASK | UART_LCRH_SPS_MASK));
}

/**
 *  @brief      Get parity mode
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The current parity mode being used
 *
 *  @retval     One of @ref DL_UART_PARITY
 *
 */
__STATIC_INLINE DL_UART_PARITY DL_UART_getParityMode(UART_Regs *uart)
{
    uint32_t parity = uart->LCRH & (UART_LCRH_PEN_MASK | UART_LCRH_EPS_MASK |
                                       UART_LCRH_SPS_MASK);

    return (DL_UART_PARITY)(parity);
}

/**
 *  @brief      Set the number of stop bits
 *
 *  When in 7816 smart code mode (DL_UART_MODE_SMART_CARD mode), the number of
 *  stop bits is forced to 2
 *
 *  @param[in]  uart         Pointer to the register overlay for the peripheral
 *  @param[in]  numStopBits  The number of stop bits transmitted.
 *                           One of @ref DL_UART_STOP_BITS
 */
__STATIC_INLINE void DL_UART_setStopBits(
    UART_Regs *uart, DL_UART_STOP_BITS numStopBits)
{
    DL_Common_updateReg(
        &uart->LCRH, (uint32_t) numStopBits, UART_LCRH_STP2_MASK);
}

/**
 *  @brief      Get the number of stop bits
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The number of stop bits transmitted.
 *
 *  @retval     One of @ref DL_UART_STOP_BITS
 */
__STATIC_INLINE DL_UART_STOP_BITS DL_UART_getStopBits(UART_Regs *uart)
{
    uint32_t numStopBits = uart->LCRH & UART_LCRH_STP2_MASK;

    return (DL_UART_STOP_BITS)(numStopBits);
}

/**
 *  @brief      Set the word length
 *
 *  @param[in]  uart        Pointer to the register overlay for the peripheral
 *  @param[in]  wordLength  The number of data bits transmitted or received in
 *                           a frame. One of @ref DL_UART_WORD_LENGTH
 */
__STATIC_INLINE void DL_UART_setWordLength(
    UART_Regs *uart, DL_UART_WORD_LENGTH wordLength)
{
    DL_Common_updateReg(
        &uart->LCRH, (uint32_t) wordLength, UART_LCRH_WLEN_MASK);
}

/**
 *  @brief      Get the word length
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The length of the data bits transmitted or received in a frame
 *
 *  @retval     One of @ref DL_UART_WORD_LENGTH
 */
__STATIC_INLINE DL_UART_WORD_LENGTH DL_UART_getWordLength(UART_Regs *uart)
{
    uint32_t wordLength = uart->LCRH & UART_LCRH_WLEN_MASK;

    return (DL_UART_WORD_LENGTH)(wordLength);
}

/**
 *  @brief      Send idle pattern
 *
 *  When enabled, a SENDIDLE period of 11 bit times will be sent on the TX
 *  line. The bit is cleared by hardware afterwards.
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableSendIdlePattern(UART_Regs *uart)
{
    uart->LCRH |= UART_LCRH_SENDIDLE_ENABLE;
}

/**
 *  @brief      Disable send idle pattern
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableSendIdlePattern(UART_Regs *uart)
{
    uart->LCRH &= ~(UART_LCRH_SENDIDLE_MASK);
}

/**
 *  @brief      Check if send idle pattern is enabled
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of the send idle pattern
 *
 *  @retval     true  Send idle pattern is enabled
 *  @retval     false Send idle pattern is disabled
 */
__STATIC_INLINE bool DL_UART_isSendIdlePatternEnabled(UART_Regs *uart)
{
    return (
        (uart->LCRH & UART_LCRH_SENDIDLE_MASK) == UART_LCRH_SENDIDLE_ENABLE);
}

/**
 *  @brief      Set external driver setup value
 *
 *  Defines the number of UARTclk ticks the signal to control the external
 *  driver for the RS485 will be set before the START bit is sent
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *  @param[in]  val   The number of UARTclk ticks the signal before the RS485
 *                    is setup. Value between 0 - 31.
 */
__STATIC_INLINE void DL_UART_setExternalDriverSetup(
    UART_Regs *uart, uint32_t val)
{
    DL_Common_updateReg(&uart->LCRH, val << UART_LCRH_EXTDIR_SETUP_OFS,
        UART_LCRH_EXTDIR_SETUP_MASK);
}

/**
 *  @brief      Get the external driver setup value
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return    The number of UARTclk ticks the signal to control the
 *             external driver
 *
 *  @retval     0 - 31 The number of UARTclk ticks
 */
__STATIC_INLINE uint32_t DL_UART_getExternalDriverSetup(UART_Regs *uart)
{
    return ((uart->LCRH &
             UART_LCRH_EXTDIR_SETUP_MASK >> UART_LCRH_EXTDIR_SETUP_OFS));
}

/**
 *  @brief      Set external driver setup hold
 *
 *  Defines the number of UARTclk ticks the signal to control the external
 *  driver for the RS485 will be reset after the beginning of the stop bit.
 *  If 2 STOP bits are enabled, the RS485 will be reset at the beginning of
 *  the 2nd STOP bit.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *  @param[in]  val   The number of UARTclk ticks the signal to hold the
 *                    external driver before the RS485 will be reset.
 *                    Value between 0 - 31.
 */
__STATIC_INLINE void DL_UART_setExternalDriverHold(
    UART_Regs *uart, uint32_t val)
{
    DL_Common_updateReg(&uart->LCRH, val << UART_LCRH_EXTDIR_HOLD_OFS,
        UART_LCRH_EXTDIR_HOLD_MASK);
}

/**
 *  @brief      Get the external driver setup hold
 *
 *  @param[in]  uart   Pointer to the register overlay for the peripheral
 *
 *  @return     The number of UARTclk ticks the signal to hold the
 *              external driver before the RS485 will be reset
 *
 *  @retval     0 - 31 The number of UARTclk ticks
 */
__STATIC_INLINE uint32_t DL_UART_getExternalDriverHold(UART_Regs *uart)
{
    return ((
        uart->LCRH & UART_LCRH_EXTDIR_HOLD_MASK >> UART_LCRH_EXTDIR_HOLD_OFS));
}

/**
 *  @brief      Checks if the UART is busy
 *
 *  This bit is set as soon as the transmit FIFO or TXDATA register becomes
 *  non-empty (regardless of whether UART is enabled) or if a receive data is
 *  currently ongoing (after the start edge have been detected until a complete
 *  byte, including all stop bits, has been received by the shift register).
 *
 *  In IDLE Line mode the Busy signal also stays set during the idle time
 *  generation.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of the UART Busy bit
 *
 *  @retval     true   The UART is busy
 *  @retval     false  The UART is not busy
 *
 */
__STATIC_INLINE bool DL_UART_isBusy(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_BUSY_MASK) == UART_STAT_BUSY_SET);
}

/**
 *  @brief      Checks if the RX FIFO is empty
 *
 *  The meaning of this bit depends on if the FIFOs were enabled.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the empty status of the RX FIFO
 *
 *  @retval     true   If the FIFO is enabled, the receive FIFO is empty.
 *                     If the FIFO is disabled, the receiver has no data.
 *  @retval     false  The receiver is not empty
 *
 *  @sa         DL_UART_enableFIFOs
 */
__STATIC_INLINE bool DL_UART_isRXFIFOEmpty(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_RXFE_MASK) == UART_STAT_RXFE_SET);
}

/**
 *  @brief      Checks if the RX FIFO is full
 *
 *  The meaning of this bit depends on if the FIFOs were enabled.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the full status of the RX FIFO
 *
 *  @retval     true   If the FIFO is enabled, the receive FIFO is full.
 *                     If the FIFO is disabled, the receiver has 1-byte
 *                     of data.
 *  @retval     false  The receiver is not full
 *
 *  @sa         DL_UART_enableFIFOs
 */
__STATIC_INLINE bool DL_UART_isRXFIFOFull(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_RXFF_MASK) == UART_STAT_RXFF_SET);
}

/**
 *  @brief      Checks if the TX FIFO is empty
 *
 *  The meaning of this bit depends on if the FIFOs were enabled.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the empty status of the TX FIFO
 *
 *  @retval     true   If the FIFO is enabled, the transmit FIFO is empty.
 *                     If the FIFO is disabled, the transmitter has no data.
 *  @retval     false  The transmitter is not empty
 *
 *  @sa         DL_UART_enableFIFOs
 */
__STATIC_INLINE bool DL_UART_isTXFIFOEmpty(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_TXFE_MASK) == UART_STAT_TXFE_SET);
}

/**
 *  @brief      Checks if the TX FIFO is full
 *
 *  The meaning of this bit depends on if the FIFOs were enabled.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the full status of the TX FIFO
 *
 *  @retval     true   If the FIFO is enabled, the transmit FIFO is full.
 *                     If the FIFO is disabled, the transmitter has 1-byte
 *                     of data.
 *  @retval     false  The transmitter is not full
 *
 *  @sa         DL_UART_enableFIFOs
 */
__STATIC_INLINE bool DL_UART_isTXFIFOFull(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_TXFF_MASK) == UART_STAT_TXFF_SET);
}

/**
 *  @brief      Checks if UART is clear to send
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the status of the CTS signal
 *
 *  @retval     true   The CTS signal is asserted (low)
 *  @retval     false  The CTS signal is not asserted (high)
 *
 *  @sa         DL_UART_isClearToSendEnabled
 */
__STATIC_INLINE bool DL_UART_isClearToSend(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_CTS_MASK) == UART_STAT_CTS_SET);
}

/**
 *  @brief      Checks if Idle mode has been detected
 *
 *  Idle mode has been detected in Idleline-Multiprocessor-Mode. The IDLE bit
 *  is used as an address tag for each block of characters. In idle-line
 *  multiprocessor format, this bit is set when a received character is an
 *  address.
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the status if Idle mode has been detected
 *
 *  @retval     true  Idle has been detected before last received character
 *  @retval     false Idle has not been detected before last received character
 *
 */
__STATIC_INLINE bool DL_UART_isIdleModeDetected(UART_Regs *uart)
{
    return ((uart->STAT & UART_STAT_IDLE_MASK) == UART_STAT_IDLE_SET);
}

/**
 *  @brief      Set the TX FIFO interrupt threshold level
 *
 *  Select the threshold for the transmit FIFO interrupt. The interrupts are
 *  generated based on a transition through a level rather than being based on
 *  the level. That is, the interrupts are generated when the fill level
 *  progresses through the trigger level. For example, if the transmit trigger
 *  level is set to the half-way mark, the interrupt is triggered when the
 *  transmit FIFO becomes half empty. In other words, if the transmit FIFO was
 *  filled with four characters, the interrupt would trigger once there are
 *  two or less characters after transmitting.
 *
 *  @param[in]  uart       Pointer to the register overlay for the peripheral
 *  @param[in]  threshold  One of @ref DL_UART_TX_FIFO_LEVEL
 *
 */
__STATIC_INLINE void DL_UART_setTXFIFOThreshold(
    UART_Regs *uart, DL_UART_TX_FIFO_LEVEL threshold)
{
    DL_Common_updateReg(
        &uart->IFLS, (uint32_t) threshold, UART_IFLS_TXIFLSEL_MASK);
}

/**
 *  @brief      Get the TX FIFO interrupt threshold level
 *
 *  @param[in]  uart  Pointer to the register overlay for the peripheral
 *
 *  @return     The TX FIFO interrupt threshold level
 *
 *  @retval     One of @ref DL_UART_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_UART_TX_FIFO_LEVEL DL_UART_getTXFIFOThreshold(
    UART_Regs *uart)
{
    uint32_t threshold = uart->IFLS & UART_IFLS_TXIFLSEL_MASK;

